yuchou87/xiaoputao-speaker/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# PSRAM: 8MB octal @ 80MHz
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Flash 16MB
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# CPU 240MHz
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Console over USB-Serial-JTAG (this board's USB-C)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# LVGL: RGB565 byte-swap for this QSPI panel
CONFIG_LV_COLOR_16_SWAP=y

# esp-sr (2.4.x): AFE/WakeNet are always built; only select the wake-word model.
# Builtin 你好小智 (WN9S) for bring-up; custom 你好小葡萄 (TTS-trained) comes later.
# Models default to the SPIFFS 'model' partition.
CONFIG_SR_WN_WN9S_NIHAOXIAOZHI=y
